#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.repos.github_branch_default.default_pipelines["Pipelines"] will be created
  + resource "github_branch_default" "default_pipelines" {
      + branch     = "master"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = true
      + repository = "Pipelines"
    }

  # module.repos.github_repository.repository_pipelines["Pipelines"] will be created
  + resource "github_repository" "repository_pipelines" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Repository managed by Terraform"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "Pipelines"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }
    }

  # module.repos.github_repository_file.ci_file["Pipelines"] will be created
  + resource "github_repository_file" "ci_file" {
      + branch              = "refs/heads/master"
      + commit_message      = "Añade o actualiza ci.yml via terraform ***NO_CI***"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: CI
            
            on:
              pull_request:
                branches: [ master ]
            
            jobs:
              build:
            
                runs-on: self-hosted
            
                steps:
                  - uses: actions/checkout@v3
            
                  - name: Set up JDK 11
                    uses: actions/setup-java@v3
                    with:
                      java-version: '11'
                      distribution: 'zulu'
                      server-password: MAVEN_PASSWORD
            
                  - name: Cache local Maven repository
                    uses: actions/cache@v3
                    with:
                      path: ~/.m2/repository
                      key: ${{ runner.os }}-maven-${{ hashFiles('**/pom.xml') }}
                      restore-keys: |
                        ${{ runner.os }}-maven-
            
                  - name: Build with Maven
                    run: mvn -B package -Djacoco.execFile='${coverage.reports.dir}/actions-jacoco.exec'
                    env:
                      MAVEN_PASSWORD: ${{ secrets.MAVEN_PACKAGE_READ_TOKEN }}
            
                  - name: Upload Jacoco coverage
                    uses: actions/upload-artifact@v3
                    with:
                      name: actions-jacoco
                      path: "./target/coverage-reports/actions-jacoco.exec"
            
                  - name: Upload artifacts
                    uses: actions/upload-artifact@v3
                    with:
                      name: ${{ github.event.repository.name }}.jar
                      path: target/${{ github.event.repository.name }}.jar
            
              sonar:
                runs-on: self-hosted
            
                needs: [ build ]
            
                steps:
                  - uses: actions/checkout@v3
                    with:
                      fetch-depth: 0
            
                  - name: Set up JDK 11
                    uses: actions/setup-java@v3
                    with:
                      java-version: '11'
                      distribution: 'zulu'
                      server-password: MAVEN_PASSWORD
            
                  - name: Cache local Maven repository
                    uses: actions/cache@v3
                    with:
                      path: ~/.m2/repository
                      key: self-hosted-${{ runner.os }}-maven-${{ hashFiles('**/pom.xml') }}
                      restore-keys: |
                        self-hosted-${{ runner.os }}-maven-
            
                  - name: Cache SonarQube packages
                    uses: actions/cache@v3
                    with:
                      path: ~/.sonar/cache
                      key: ${{ runner.os }}-sonarqube
                      restore-keys: |
                        ${{ runner.os }}-sonarqube
            
                  - name: Download actions Jacoco coverage
                    uses: actions/download-artifact@v3
                    with:
                      name: actions-jacoco
            
                  - name: Run Jacoco report
                    run: |
                      mvn -B compile
                      mvn jacoco:report@coverage-report -P jacoco-ci
                    env:
                      MAVEN_PASSWORD: ${{ secrets.MAVEN_PACKAGE_READ_TOKEN }}
            
                  - name: Scan with SonarQube
                    run: mvn -B sonar:sonar -Dsonar.pullrequest.key=${{ github.event.number }} -Dsonar.pullrequest.branch=${GITHUB_HEAD_REF} -Dsonar.pullrequest.base=${GITHUB_BASE_REF} -Dsonar.scm.revision=${{ github.event.pull_request.head.sha }}
                    env:
                      GITHUB_TOKEN: ${{ secrets.GITHUB_TOKEN }}
                      SONAR_TOKEN: ${{ secrets.SONAR_TOKEN }}
                      SONAR_HOST_URL: ${{ secrets.SONAR_HOST_URL }}
                      MAVEN_PASSWORD: ${{ secrets.MAVEN_PACKAGE_READ_TOKEN }}
        EOT
      + file                = ".github/workflows/ci.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "Pipelines"
      + sha                 = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

</details>


*Pusher: @josue-r, Action: `pull_request`, Working Directory: `/home/josue/actions-runner/_work/terraform-jrs-local/terraform-jrs-local`, Workflow: `Create terraform plan`*